[
  {
    "section": "1",
    "title": "Purpose",
    "content": [
      "(1) The purpose of this Act is to ensure that the system of administration of criminal justice in Nigeria promotes efficient management of criminal justice institutions, speedy dispensation of justice, protection of the society from crime and protection of the rights and interests of the suspect, the defendant, and the victim.",
      "(2) The courts, law enforcement agencies and other authorities or persons involved in criminal justice administration shall ensure compliance with the provisions of this Act for the realisation of its purposes."
    ],
    "pidgin_translation": "Di main aim of dis Act na to make sure say how den dey handle criminal mata for Nigeria helep manage justice place well, make justice quick, protect pipo from bad bad pipo, and protect di right of person wey den suspect, person wey den dey accuse, and victim."
  },
  {
    "section": "2",
    "title": "Application",
    "content": [
      "(1) Without prejudice to section 86 of this Act, the provisions of this Act shall apply to criminal trials for offences established by an Act of the National Assembly and other offences punishable in the Federal Capital Territory, Abuja.",
      "(2) The provisions of this Act shall not apply to a Court Martial."
    ],
    "pidgin_translation": "Dis Act go apply for criminal case for offense wey National Assembly law talk about and oda offense wey den fit punish for Abuja. But e no go apply for Court Martial (army court)."
  },
  {
    "section": "3",
    "title": "Arrest generally",
    "content": [
      "A suspect or defendant alleged or charged with committing an offence established by an Act of the National Assembly shall be arrested, investigated, inquired into, tried or dealt with according to the provisions of this Act, except otherwise provided under this Act."
    ],
    "pidgin_translation": "If den suspect or accuse person say e do offense wey law of National Assembly talk about, na dis Act den go use arrest, check, ask question, try or deal with am, except if dis Act talk anoda thing."
  },
  {
    "section": "4",
    "title": "Mode of arrest",
    "content": [
      "In making an arrest, the police officer or other persons making the arrest shall actually touch or confine the body of the suspect, unless there is a submission to the custody by word or action."
    ],
    "pidgin_translation": "When police or any pesin dey arrest, dem must touch or hold di body of di suspect, except if di suspect gree by word or action say dem don catch am."
  },
  {
    "section": "5",
    "title": "No unnecessary restraint",
    "content": [
      "A suspect or defendant may not be handcuffed, bound or be subjected to restraint except:",
      "(a) there is reasonable apprehension of violence or an attempt to escape;",
      "(b) the restraint is considered necessary for the safety of the suspect or defendant; or",
      "(c) by order of a court."
    ],
    "pidgin_translation": "Dem no suppose handcuff, tie or hold suspect or defendant except if: (a) e look like say gbege fit sele or di person wan run; (b) e dey important for di safety of di suspect or defendant; or (c) court talk say make dem do am."
  },
  {
    "section": "6",
    "title": "Notification of cause of arrest and rights of suspect",
    "content": [
      "(1) Except when the suspect is in the actual course of the commission of an offence or is pursued immediately after the commission of an offence or has escaped from lawful custody, the police officer or other persons making the arrest shall inform the suspect immediately of the reason for the arrest.",
      "(2) The police officer or the person making the arrest or the police officer in charge of a police station shall inform the suspect of his rights to:",
      "(a) remain silent or avoid answering any question until after consultation with a legal practitioner or any other person of his own choice;",
      "(b) consult a legal practitioner of his choice before making, endorsing or writing any statement or answering any question put to him after arrest; and",
      "(c) free legal representation by the Legal Aid Council of Nigeria where applicable:",
      "Provided the authority having custody of the suspect shall have the responsibility of notifying the next of kin or relative of the suspect of the arrest at no cost to the suspect."
    ],
    "pidgin_translation": "Police must tell you why dem arrest you, and say you get right to remain silent, see your lawyer before you talk or write anything, and get free lawyer if you no fit pay. Dem suppose tell your family say dem arrest you, for free."
  },
  {
    "section": "7",
    "title": "Arrest in lieu prohibited",
    "content": [
      "A person shall not be arrested in place of a suspect."
    ],
    "pidgin_translation": "Police no fit arrest person wey no do anything just because dem dey find anoda pesin."
  },
  {
    "section": "8",
    "title": "Humane treatment of arrested suspect",
    "content": [
      "A suspect shall:",
      "(a) be accorded humane treatment, having regard to his right to the dignity of his person; and",
      "(b) not be subjected to any form of torture, cruel, inhuman or degrading treatment."
    ],
    "pidgin_translation": "Dem must treat any suspect like human being, make dem no torture am or do am bad thing."
  },
  {
    "section": "9",
    "title": "Search of arrested suspect",
    "content": [
      "(1) Where a police officer or a private person arrests a suspect, he may search the suspect, and place in safe custody all articles other than personal effects found on him.",
      "(2) Where an arrested suspect is taken to a police station, the police officer in charge of the station or an officer delegated by him for that purpose, may search the suspect and place in safe custody all articles other than personal effects found on him: Provided that a female suspect shall only be searched by a woman police officer."
    ],
    "pidgin_translation": "If dem arrest you, dem fit search you and keep your things safe. But na woman go search woman."
  },
  {
    "section": "10",
    "title": "Inventory of property of arrested suspect",
    "content": [
      "(1) Where a police officer or a private person searches an arrested suspect, he shall make an inventory of the property found or seized from the suspect.",
      "(2) The police officer or private person shall, where the inventory is made at the police station, make the inventory in the presence of the suspect and the inventory shall be signed or thumb printed by the suspect.",
      "(3) Where the suspect refuses to sign or thumb print the inventory, the police officer shall record that fact and the inventory shall be signed by the police officer who made the inventory and an independent witness.",
      "(4) A copy of the inventory shall be given to the suspect."
    ],
    "pidgin_translation": "If dem search you and collect your property, dem go list everything, you go sign am, and dem go give you copy."
  },
  {
    "section": "11",
    "title": "Examination of arrested suspect",
    "content": [
      "(1) Where a suspect is arrested and a police officer has reasonable grounds to believe that an examination of his person will afford evidence as to the commission of the offence, any qualified medical practitioner or any other qualified person acting in good faith in his aid and under his direction, may make such an examination of the suspect in custody as is reasonably necessary in order to ascertain the facts which may afford such evidence, and take such measures as are reasonably necessary for that purpose.",
      "(2) Where a suspect is a female, she shall only be examined by a qualified medical practitioner who is a female.",
      "(3) Where a suspect who is in custody is taken to a hospital for medical examination, the suspect shall be deemed to be in lawful custody.",
      "(4) An examination under this section may include the taking of specimen from the body of the suspect.",
      "(5) The result of an examination carried out under this section shall be made available to the suspect and the legal practitioner of the suspect on request."
    ],
    "pidgin_translation": "Doctor fit check your body if police think say e go help find evidence. If you be woman, na woman doctor go check you. Dem fit take sample, and you fit collect the result."
  },
  {
    "section": "12",
    "title": "Search of place entered by suspect sought to be arrested",
    "content": [
      "(1) Where a suspect against whom a warrant of arrest is issued or a police officer has authority to arrest, has reason to believe that the suspect has entered into or is within any house or place, the person residing in or in charge of the house or place shall, on demand by the police officer or person executing the warrant, allow him free access into the house or place and afford all reasonable facilities to search the house or place for the suspect sought to be arrested.",
      "(2) Where access to a house or place cannot be obtained under subsection (1) of this section, the police officer or person executing the warrant may enter the house or place and search it for the suspect and in order to effect an entrance into the house or place, may break open any outer or inner door or window of the house or place, if after notification of his authority and purpose, and demand of admittance duly made, he cannot otherwise obtain admittance."
    ],
    "pidgin_translation": "If police believe say suspect hide for one house, the person for that house must allow dem enter. If dem no gree, police fit break door enter."
  },
  {
    "section": "13",
    "title": "Power to break out of a house or place for purpose of liberation",
    "content": [
      "A police officer or any other person authorised to make an arrest may break out of any house or place in order to liberate himself or any other person who, having lawfully entered for the purpose of making an arrest, is detained in the house or place."
    ],
    "pidgin_translation": "If police enter house legally and person lock dem inside, dem fit break door or window take escape."
  },
  {
    "section": "14",
    "title": "Arrested suspect to be taken immediately to police station",
    "content": [
      "(1) A suspect who is arrested, whether with or without a warrant, shall be taken immediately to a police station, or other place for the reception of suspect, and shall be promptly informed of the allegation against him.",
      "(2) A person who has the custody of an arrested suspect shall give the suspect reasonable facilities for obtaining legal advice, access to communication for taking steps to furnish bail, and otherwise making arrangements for his defence or release."
    ],
    "pidgin_translation": "If dem arrest you, dem must carry you go police station quick, tell you wetin you do, and give you chance to call lawyer or arrange for bail."
  },
  {
    "section": "15",
    "title": "Recording of arrests",
    "content": [
      "(1) When a suspect is arrested, whether with or without warrant, and taken to the police station or any other agency effecting the arrest, the police officer making the arrest or the officer in charge of the station or agency shall cause to be taken immediately, in the prescribed form, the particulars of the suspect.",
      "(2) The particulars shall include:",
      "(a) the alleged offence;",
      "(b) the date and circumstances of his arrest;",
      "(c) his full name, occupation and residential address; and",
      "(d) for the purpose of identification:",
      "(i) his height,",
      "(ii) his photograph,",
      "(iii) his full fingerprint impressions, or",
      "(iv) any other means of identification.",
      "(3) The information shall be entered in a record book to be kept for that purpose for the police station or agency, and the suspect’s photograph and fingerprint impressions may be entered in the criminal record."
    ],
    "pidgin_translation": "Police go write your full details—why dem arrest you, your name, address, height, take your picture and fingerprint, and enter everything for record book."
  },
  {
    "section": "16",
    "title": "Central Criminal Records Registry",
    "content": [
      "(1) There shall be a Central Criminal Records Registry for the Nigeria Police Force.",
      "(2) The Central Criminal Records Registry shall be located at the Nigeria Police Force Headquarters and a branch of the Registry shall be maintained at every state police command.",
      "(3) The Central Criminal Records Registry shall have the following, relating to persons arrested and convicted under this Act:",
      "(a) personal data which shall include the person’s name, age, sex, address, occupation and other information that may be relevant for identification;",
      "(b) biometrics which shall include fingerprints, palm prints, foot prints, facial recognition, Deoxyribonucleic Acid (DNA) samples, and other related biometrics features;",
      "(c) photographs;",
      "(d) summary of the offence committed by the person; and",
      "(e) date and place of conviction, sentence or other disposition of the case.",
      "(4) The information kept in the Central Criminal Records Registry shall be made available to courts and law enforcement agencies where necessary."
    ],
    "pidgin_translation": "Police go get big office wey go store all record of people wey dem don arrest or convict—like name, fingerprint, picture, DNA and wetin the person do."
  },
  {
    "section": "17",
    "title": "Recording of statement of suspects",
    "content": [
      "(1) Where a suspect is arrested on allegation of having committed an offence, his statement shall be taken only when he wishes to make a statement.",
      "(2) Such statement may be taken in the presence of a legal practitioner of his choice, or where he has no legal practitioner of his choice, in the presence of an officer of the Legal Aid Council of Nigeria or an official of a Civil Society Organisation or a Justice of the Peace or any other person of his choice. Provided that the Legal Practitioner or any other person mentioned in this subsection shall not interfere while the suspect is making his statement, except for the purpose of discharging his role as a legal practitioner.",
      "(3) Where a suspect does not understand or speak English language, the statement shall be interpreted by an interpreter.",
      "(4) The statement of the suspect shall be recorded in writing by the investigating police officer or any police officer so designated.",
      "(5) The suspect shall also be given the opportunity to make his statement in the language he understands."
    ],
    "pidgin_translation": "If dem arrest you and you wan talk, dem go write wetin you talk. You fit get lawyer or trusted person with you. If you no sabi English, interpreter go help. You fit talk for language wey you understand."
  },
  {
    "section": "18",
    "title": "Arrest by police officer without warrant",
    "content": [
      "(1) A police officer may, without an order from a Magistrate and without a warrant, arrest a suspect:",
      "(a) whom he suspects on reasonable grounds of having committed an indictable offence against a Federal law or against the law of a State or the Federal Capital Territory, Abuja, unless the written law creating the offence provides that the suspect cannot be arrested without a warrant;",
      "(b) who commits an offence in his presence;",
      "(c) who obstructs a police officer while in the execution of his duty, or who has escaped or attempts to escape from lawful custody;",
      "(d) in whose possession anything is found which may reasonably be suspected to be stolen property or who may reasonably be suspected of having committed an offence with reference to any such thing;",
      "(e) whom he suspects on reasonable grounds of being a deserter from any of the armed forces of Nigeria;",
      "(f) whom he suspects on reasonable grounds of having been concerned in an act committed at any place out of Nigeria which, if committed in Nigeria, would have been punishable as an offence, and for which he is, under a law in force in Nigeria, liable to be apprehended and detained in Nigeria;",
      "(g) having in his possession without lawful excuse, the proof of which excuse shall lie on him, any implement of housebreaking, firearm or offensive weapon or any implement that can be used to commit an offence;",
      "(h) whom he has reasonable cause to believe a warrant of arrest has been issued by a court of competent jurisdiction in Nigeria;",
      "(i) found in the Federal Capital Territory, Abuja taking precautions to conceal his presence in circumstances which afford reason to believe that he is taking such precautions with a view to committing an offence;",
      "(j) who is a vagrant and has no visible means of subsistence and cannot give a good account of himself; or",
      "(k) who is reasonably suspected of being in unlawful possession of a suspicious or stolen item.",
      "(2) The authority given to a police officer to arrest a suspect without a warrant by virtue of subsection (1) (a) of this section shall not apply to an offence, which is a misdemeanour or a simple offence."
    ],
    "pidgin_translation": "Police fit arrest person without warrant if dem get reason to believe say the person commit serious crime, hold stolen property, run from custody, carry weapon without excuse, or do any suspicious thing."
  },
  {
    "section": "19",
    "title": "Refusal to give name and residence",
    "content": [
      "(1) Where a suspect who is arrested without a warrant, other than a suspect arrested under section 18 (1) (b) of this Act, refuses to give his name and residential address to the police officer, or gives a name or residential address which the police officer has reasonable grounds for believing to be false, he may be taken by the police officer before a Magistrate.",
      "(2) Where the Magistrate is satisfied that the suspect’s name or residential address is false, the Magistrate may require him to furnish his correct name and residential address.",
      "(3) Where the suspect refuses or fails to furnish his correct name or residential address, the Magistrate may order his remand in prison custody for a period not exceeding 7 days or until he furnishes his correct name and residential address.",
      "(4) Where the suspect furnishes his correct name and residential address, the Magistrate shall order his release from custody and may deal with him in accordance with the provisions of this Act."
    ],
    "pidgin_translation": "If police arrest you and you no gree talk your name or address, or you lie, dem fit carry you go Magistrate. If you no still talk true, court fit send you go prison small until you talk correct one."
  },
  {
    "section": "20",
    "title": "Arrest by private persons",
    "content": [
      "(1) A private person may arrest a suspect in Nigeria who in his presence commits an indictable offence, or whom he reasonably suspects of having committed an offence for which the police is entitled to arrest without a warrant.",
      "(2) A suspect arrested by a private person shall, without unnecessary delay, be handed over to a police officer, or in the absence of a police officer, shall be taken to the nearest police station.",
      "(3) The police officer shall make a note of the name, address and other particulars of the private person making the arrest, and the date, time and other circumstances of the arrest and where the arrest was made on a reasonable suspicion, the police officer shall investigate the case.",
      "(4) Where the police officer is satisfied that there is sufficient reason to believe that the suspect handed over has committed an indictable offence for which the police may arrest without warrant, the police officer shall re-arrest him.",
      "(5) Where the police officer is satisfied that there is no sufficient reason to believe that the suspect has committed an offence, he shall be released immediately."
    ],
    "pidgin_translation": "If you see person commit serious crime, you fit arrest am as normal citizen, but you must carry am go police station quick. Police go check if the arrest make sense, if e no make sense, dem go release am."
  },
  {
    "section": "21",
    "title": "Arrest by owner of property",
    "content": [
      "The owner of a property or his servants may arrest any person found committing an offence involving injury to his property."
    ],
    "pidgin_translation": "If person dey damage your property, you or your workers fit arrest am."
  },
  {
    "section": "22",
    "title": "Arrest of suspect doing damage to public property",
    "content": [
      "A private person may arrest any suspect found damaging public property."
    ],
    "pidgin_translation": "If you see person dey spoil government property, you fit arrest am as normal person."
  },
  {
    "section": "23",
    "title": "Handing over of an arrested suspect by private person",
    "content": [
      "(1) A private person who arrests a suspect shall immediately hand him over to a police officer, or in the absence of a police officer, shall take the suspect to the nearest police station, and the police officer shall take custody of the suspect.",
      "(2) Where there is reason to believe that the arrested suspect has committed an indictable offence, and he refuses to give his name and address, or gives a false name or address, he shall be dealt with under section 19 of this Act.",
      "(3) Where a suspect arrested by a private person is handed over to a police station, the officer in charge of the station shall take note of the particulars of the suspect and the person who arrested him.",
      "(4) Where there is no sufficient reason to believe that the suspect has committed any offence, he shall be released immediately."
    ],
    "pidgin_translation": "If normal person arrest you, dem must carry you go give police without delay. If you lie about your name or address, police fit handle you like section 19 talk. If you no do any wrong, dem go release you."
  },
  {
    "section": "24",
    "title": "Offence committed in presence of Judge or Magistrate",
    "content": [
      "When an offence is committed in the presence of a Judge or Magistrate, he may himself arrest or order any person to arrest the suspect and may thereupon, subject to the provisions of this Act as to bail, commit the suspect to custody."
    ],
    "pidgin_translation": "If you commit crime for front of Judge or Magistrate, dem fit arrest you by themselves or tell person make e arrest you, and dem fit send you go custody."
  },
  {
    "section": "25",
    "title": "Arrest by Magistrate",
    "content": [
      "(1) A Magistrate may arrest or direct the arrest in his presence of a suspect whose arrest is for an offence committed in his presence, or for which he is competent at the time and in the circumstances to issue a warrant of arrest.",
      "(2) A Magistrate making an arrest under subsection (1) of this section shall, unless the offence is one for which he may himself grant bail, commit the suspect to custody until he can be brought before a court having jurisdiction."
    ],
    "pidgin_translation": "Magistrate fit arrest person wey commit offence for im front or wey e suppose issue warrant for. If na serious matter, Magistrate go put the person for custody until proper court handle the case."
  },
  {
   "section": "26",
    "title": "Arrest for offence committed in presence of Judge, Magistrate or Justice of the Peace",
    "content": [
      "A Judge, Magistrate or Justice of the Peace may arrest or direct the arrest of a suspect committing an offence in his presence, or for which he is competent at the time and in the circumstances to issue a warrant of arrest."
    ],
    "pidgin_translation": "Judge, Magistrate, or Justice of the Peace fit arrest person or order make dem arrest person wey commit crime for their front, or person wey dem fit issue warrant for."
  },
  {
    "section": "27",
    "title": "When public is bound to assist in arrest",
    "content": [
      "(1) Every person is bound to assist a Judge, Magistrate, Justice of the Peace, police officer or other officer of court or a local government staff or any other person authorised to make arrest, when called upon by any of them to assist in the arrest of a suspect, or in the prevention of a breach of the peace, or in the suppression of a riot or affray, or in the prevention of any injury being done to any public property.",
      "(2) A person who, without reasonable excuse, fails to assist as provided in subsection (1) of this section, commits an offence and is liable on conviction to a fine not exceeding N50,000.00 or imprisonment for a term not exceeding 3 months or both."
    ],
    "pidgin_translation": "Everybody suppose helep Judge, police, or any officer wey dem call upon to assist in arrest, stop fight, or protect government property. If you no helep without good reason, you fit pay fine or go prison."
  },
  {
    "section": "28",
    "title": "Pursuit of suspect into other jurisdictions",
    "content": [
      "(1) A suspect who escapes or is being pursued after committing an offence in Nigeria or for whom a warrant has been issued in Nigeria, may be arrested in any other part of Nigeria.",
      "(2) Where an offence is committed by a suspect in one state and the suspect escapes to another state, a warrant may be issued in the state where the offence was committed, and the warrant may be executed in the state where the suspect is apprehended."
    ],
    "pidgin_translation": "If person commit crime for one place for Nigeria and run go anoda place, dem fit still arrest am there. If court issue warrant for am for one state, dem fit use am arrest am for anoda state."
  },
  {
    "section": "29",
    "title": "Quarterly report of arrests to the Attorney-General",
    "content": [
      "(1) The Inspector-General of Police and the heads of other law enforcement agencies shall, on the last working day of every quarter, remit to the Attorney-General of the Federation a record of all arrests made in relation to Federal offences.",
      "(2) The Attorney-General of the Federation shall, upon request by the National Human Rights Commission, the Legal Aid Council of Nigeria or a Non-Governmental Organization, make the report available to them."
    ],
    "pidgin_translation": "Police boss and other law enforcement agencies go send report every three months to di Attorney-General of di Federation about all arrests dem make for federal crimes. Di Attorney-General fit give dis report to Human Rights Commission or other groups if dem ask for am."
  },
  {
    "section": "30",
    "title": "Release on bail of a suspect arrested without warrant",
    "content": [
      "(1) Where a suspect has been arrested without warrant for an offence other than an offence punishable with death, he shall:",
      "(a) be released on bail on his entering into a recognizance with or without sureties as the police officer in charge of the station or any other police officer authorised by him may deem fit, for his appearance before a court or to appear at such other place and at such time as may be specified in the recognizance; or",
      "(b) be released on bail on his executing a bond, with or without sureties as the police officer in charge of the station or any other police officer authorised by him may deem fit, for his appearance before a court or to appear at such other place and at such time as may be specified in the bond.",
      "(2) The police officer in charge of the station or any other police officer authorised by him, may before admitting the suspect to bail, inquire into the suitability of the sureties or the sufficiency of the bond."
    ],
    "pidgin_translation": "If dem arrest you without warrant for crime wey no carry death sentence, police fit release you on bail with or without pesin wey go stand for you (surety). Police fit check if di surety or di bond amount dey okay before dem release you."
  },
  {
    "section": "31",
    "title": "Power to release on bail before charge is accepted",
    "content": [
      "A police officer or any other officer authorised to make an arrest, may at any time before a charge is accepted by the appropriate authority, release a suspect arrested on bail, with or without sureties, on his entering into a recognizance or executing a bond for his appearance before a court or to appear at such other place and at such time as may be specified in the recognizance or bond."
    ],
    "pidgin_translation": "Police fit release person wey dem arrest on bail, with or without surety, before dem even charge am, once e sign agreement to show for court or any other place dem mention."
  },
  {
    "section": "32",
    "title": "Remedy of suspect detained in custody",
    "content": [
      "(1) Where a suspect taken into custody without warrant for an offence other than an offence punishable with death is not released on bail within 24 hours from the time of his arrest, a Magistrate having jurisdiction in the place where the suspect is arrested or detained shall inquire into the circumstances constituting the arrest, and if satisfied that there are no reasonable grounds for the continued detention of the suspect, may make an order for his release from custody, with or without conditions.",
      "(2) Where the suspect is not released on bail within 48 hours of his arrest, the suspect shall be taken to the nearest Magistrate Court within the jurisdiction for a remand order."
    ],
    "pidgin_translation": "If dem arrest you without warrant for crime wey no carry death sentence and dem no release you on bail after 24 hours, Magistrate go check your case. If dem see say no good reason to still hold you, dem fit order your release. If dem no release you after 48 hours, dem must carry you go Magistrate court for remand order."
  },
  {
    "section": "33",
    "title": "Police to report to supervising Magistrates",
    "content": [
      "(1) An officer in charge of a police station or an official in charge of an agency authorised to make arrest shall, on the last working day of every month, report to the nearest Magistrate the cases of all suspects arrested without warrant within the limits of their respective stations or agency whether the suspects have been admitted to bail or not.",
      "(2) The report shall contain the particulars of the suspects arrested as prescribed in section 15 of this Act.",
      "(3) The Magistrate shall on receipt of the reports, forward them to the Criminal Justice Monitoring Committee which shall analyse the reports and advice the Attorney-General of the Federation as to the trends of arrests, bail and related matters.",
      "(4) The Attorney-General of the Federation shall, upon request by the National Human Rights Commission, the Legal Aid Council of Nigeria or a Non-Governmental Organization, make the report available to them.",
      "(5) Where no report is made in accordance with subsection (1) of this section, the Magistrate shall forward a report to the Chief Judge of the State and the Attorney-General of the State for appropriate remedial action.",
      "(6) With respect to the Federal Capital Territory, Abuja, such report referred to in subsection (5) of this section shall be forwarded to the Chief Judge of the Federal Capital Territory and the Attorney-General of the Federation for appropriate remedial action."
    ],
    "pidgin_translation": "Police and other arrest agencies must report to di nearest Magistrate every month about all suspects dem arrest without warrant, whether dem don get bail or not. Dis report go get details of di suspects. Di Magistrate go send am to Criminal Justice Monitoring Committee, and di Attorney-General of di Federation fit give dis report to human rights groups."
  },
  {
    "section": "34",
    "title": "Chief Magistrate to visit police stations every month",
    "content": [
      "(1) The Chief Magistrate, or where there is no Chief Magistrate within the police division, any Magistrate designated by the Chief Judge for that purpose, shall visit police stations or other places of detention within his jurisdiction at least once every month.",
      "(2) During a visit, the Magistrate may:",
      "(a) call for, and inspect the records of arrest;",
      "(b) ascertain the condition of suspects in custody;",
      "(c) ascertain the reasons for the continued detention of suspects;",
      "(d) in appropriate cases, exercise the powers of bail;",
      "(e) where a suspect has been detained beyond 24 hours or 48 hours, as the case may be, direct that the suspect be released on bail, or released unconditionally.",
      "(3) An officer in charge of a police station or an official in charge of an agency authorised to make arrest shall promptly comply with any directive of a Chief Magistrate or a Magistrate under subsection (2) of this section.",
      "(4) The Chief Magistrate shall make a report to the Chief Judge of the State and the Attorney-General of the State on the visits.",
      "(5) With respect to the Federal Capital Territory, Abuja, such report referred to in subsection (4) of this section shall be forwarded to the Chief Judge of the Federal Capital Territory and the Attorney-General of the Federation for appropriate remedial action."
    ],
    "pidgin_translation": "Chief Magistrate go dey visit police stations every month to check arrest records, condition of suspects, and reasons for detention. Dem fit order bail or unconditional release if suspect don stay too long. Police must obey wetin Magistrate say. Chief Magistrate go report to di Chief Judge and Attorney-General."
  },
  {
    "section": "35",
    "title": "General authority to issue warrant",
    "content": [
      "(1) Where any suspect for whose appearance or arrest a court is competent to issue a summons or warrant is present in court, the court may arrest him or order his arrest.",
      "(2) The power of a court to issue a warrant of arrest shall not be affected by the fact that the suspect is already in custody for the same offence."
    ],
    "pidgin_translation": "If person wey court fit issue warrant for dey court, court fit arrest am or order im arrest. If person already dey prison for same crime, court fit still issue warrant."
  },
  {
    "section": "36",
    "title": "Form and requisites of warrant of arrest",
    "content": [
      "(1) Every warrant of arrest issued under this Act shall be in writing, signed by the Judge or Magistrate or Justice of the Peace by whom it is issued, and shall bear the seal of the court or office.",
      "(2) Every warrant shall state shortly the offence for which it is issued, and shall name or otherwise describe the suspect, and shall order the suspect to be arrested and brought before the court issuing the warrant, or before some other court having jurisdiction in the case, to answer the complaint or information, and to be dealt with according to law.",
      "(3) Every warrant of arrest shall remain in force until it is executed or until it is cancelled by the court that issued it."
    ],
    "pidgin_translation": "Every arrest warrant go dey written, signed by Judge or Magistrate, and get court seal. E go brief about di crime, name di suspect, and order say make dem arrest am carry am come court. Warrant go dey valid until dem execute am or court cancel am."
  },
  {
    "section": "37",
    "title": "Warrant to be issued on complaint only if on oath",
    "content": [
      "A warrant of arrest may be issued on a complaint in writing and on oath."
    ],
    "pidgin_translation": "Dem fit only issue arrest warrant if person complain for written form and swear for God."
  },
  {
    "section": "38",
    "title": "Warrant may be issued on any day",
    "content": [
      "A warrant of arrest may be issued on any day, including a Sunday or public holiday."
    ],
    "pidgin_translation": "Dem fit issue arrest warrant any day, even Sunday or public holiday."
  },
  {
    "section": "39",
    "title": "Warrant to whom directed and duration",
    "content": [
      "(1) A warrant of arrest may be directed to one or more police officers or peace officers by name, or to all police officers or peace officers generally, or to a police officer or peace officer by name and to all police officers or peace officers generally.",
      "(2) A warrant directed to more than one police officer or peace officer may be executed by any one or more of them.",
      "(3) A warrant of arrest issued under this Act shall remain in force until it is executed or until it is cancelled by the court that issued it."
    ],
    "pidgin_translation": "Arrest warrant fit dey directed to one or more police officers or peace officers, by name or generally. Any of dem fit execute am. E go dey valid until dem execute am or court cancel am."
  },
  {
    "section": "40",
    "title": "Warrant of arrest may in exceptional cases be directed to other persons",
    "content": [
      "(1) A court issuing a warrant of arrest may, if its immediate execution is necessary and no police officer or peace officer is immediately available, direct it to any other person.",
      "(2) The person to whom the warrant is directed may execute it."
    ],
    "pidgin_translation": "If quick arrest dey important and no police dey around, court fit tell any other person to execute di arrest warrant."
  },
  {
    "section": "41",
    "title": "Public summons for person absconding",
    "content": [
      "(1) Where a court has reason to believe that a suspect, against whom a warrant of arrest has been issued, has absconded or is concealing himself so that the warrant cannot be executed, the court may publish a public summons in writing.",
      "(2) The public summons shall require the suspect to appear at a specified place and time not less than 30 days from the date of publishing the public summons."
    ],
    "pidgin_translation": "If court believe say person wey get arrest warrant don run or dey hide, court fit publish public announcement for am to show face for specific place and time, no less than 30 days from when dem publish am."
  },
  {
    "section": "42",
    "title": "Publication of public summons",
    "content": [
      "(1) A public summons under section 41 of this Act shall be published:",
      "(a) by affixing it to some conspicuous part of the house or homestead in which the suspect ordinarily resides;",
      "(b) by affixing it to some conspicuous part of the court;",
      "(c) by publication in a newspaper or other electronic medium; and",
      "(d) by any other means as the court may direct.",
      "(2) A statement in writing by the court issuing the public summons, to the effect that the public summons was duly published on a specified day, shall be conclusive evidence that the public summons was published on that day."
    ],
    "pidgin_translation": "Public announcement go dey put for suspect house, court, newspaper or other electronic media, and any other way court say. If court write say dem publish am, na true."
  },
  {
    "section": "43",
    "title": "Execution of warrant and procedure",
    "content": [
      "(1) A warrant of arrest may be executed by any police officer or peace officer at any time and in any place in Nigeria.",
      "(2) The police officer or peace officer executing a warrant of arrest shall notify the suspect of the substance of the warrant, and, if required, shall show the suspect the warrant."
    ],
    "pidgin_translation": "Any police or peace officer fit execute arrest warrant anytime, anywhere for Nigeria. Di officer must tell suspect wetin di warrant be and show am if dem ask."
  },
  {
    "section": "44",
    "title": "Power to arrest on warrant but without the warrant",
    "content": [
      "(1) A warrant of arrest may be executed notwithstanding that it is not in the immediate possession of the police officer or peace officer executing it, but the suspect shall, if he so requires, be shown the warrant as soon as practicable.",
      "(2) The provisions of this section shall apply to a warrant issued by a court in Nigeria and to any other warrant which may be executed in Nigeria."
    ],
    "pidgin_translation": "Police fit arrest you with warrant even if dem no get am for hand dat time, but dem must show you di warrant as soon as dem fit. Dis rule dey for all warrants wey dem fit execute for Nigeria."
  },
  {
    "section": "45",
    "title": "Court may direct particulars of security be taken on execution of warrant",
    "content": [
      "(1) A court issuing a warrant for the arrest of a suspect may, in a case other than an offence punishable with death, direct by endorsement on the warrant that if the suspect executes a bond with or without sureties for his appearance before the court on a specified date and at a specified time, the officer to whom the warrant is directed shall take such security and release the suspect from custody.",
      "(2) The endorsement shall state:",
      "(a) the number of sureties (if any);",
      "(b) the amount in which they and the suspect are to be respectively bound; and",
      "(c) the date and time at which the suspect is to attend the court."
    ],
    "pidgin_translation": "Court wey dey issue arrest warrant fit write for di warrant say if suspect sign agreement with or without surety to show for court, di officer fit collect di security and release di suspect. Di endorsement go show how many sureties, how much dem go bind, and di date and time suspect go come court."
  },
  {
    "section": "46",
    "title": "Procedure on arrest of suspect outside division or district of court issuing warrant",
    "content": [
      "(1) Where a warrant of arrest is executed outside the division or district of the court by which it was issued, the suspect shall, unless security is taken under section 45 of this Act, be taken before a court having jurisdiction in the division or district in which the arrest is made, or before a court having jurisdiction in the division or district in which the court that issued the warrant is situate, or before a court having jurisdiction in the division or district where the suspect is to be tried.",
      "(2) The court before which the suspect is taken shall, if the suspect is not bailable, commit him to custody, and if the suspect is bailable, and he is ready and willing to give bail to the satisfaction of the court, the court shall take such bail and forward the bond to the court by which the warrant was issued, and if he is not ready and willing to give bail, commit him to custody until he can be brought before the court by which the warrant was issued."
    ],
    "pidgin_translation": "If dem arrest person with warrant outside di court area wey issue am, dem go carry am go court for di area wey dem arrest am, or di court wey issue di warrant, or di court wey go try am. If e no fit get bail, dem go put am for prison. If e fit get bail and e ready, court go collect bail and send di bond to di court wey issue di warrant. If e no ready, dem go put am for prison until dem fit carry am go di court wey issue di warrant."
  },
  {
    "section": "47",
    "title": "Warrant issued by the Federal High Court",
    "content": [
      "A warrant issued by the Federal High Court may be executed in any part of Nigeria."
    ],
    "pidgin_translation": "Warrant wey Federal High Court issue fit dey executed anywhere for Nigeria."
  },
  {
    "section": "48",
    "title": "Re-arrest of suspect escaping",
    "content": [
      "(1) If a suspect, after being arrested, escapes or is rescued from custody, the person from whose custody he escapes or is rescued may immediately pursue and arrest him in any place in Nigeria.",
      "(2) A person who escapes or is rescued from custody may be re-arrested without a fresh warrant.",
      "(3) The provisions of this section shall apply to a suspect who has escaped or is rescued from custody in Nigeria or from the custody of any other person lawfully arresting him in Nigeria."
    ],
    "pidgin_translation": "If person wey dem don arrest run or dem rescue am, di person wey dey hold am fit pursue and arrest am anywhere for Nigeria sharp sharp. Dem fit re-arrest am without new warrant. Dis rule dey for anybody wey run or wey dem rescue for Nigeria."
  },
  {
    "section": "49",
    "title": "Provisions of sections 12 and 13 to apply to arrests under section 48",
    "content": [
      "The provisions of sections 12 and 13 of this Act shall apply to arrests made under section 48 of this Act."
    ],
    "pidgin_translation": "Wetin section 12 and 13 talk go apply when dem dey arrest person wey run or wey dem rescue, as section 48 talk."
  }
]
